Config/Reports/КассоваяКнига.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>КассоваяКнига</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВсемОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиТитульныеЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фондовые</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиТолькоТитульныеЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОтветственногоЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительПФС</Name>
					<Comment>Руководитель планово-финансовой службы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйИсполнительКадры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВедетсяКассоваяКнига</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment> Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленнаяНумерацияДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Подразделение является обособленным</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаФСГС</Name>
					<Comment>Код территориального органа государственной статистики </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Reports/КассоваяКнига/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Отчет, Параметры);
	
	Если НЕ ЗначениеЗаполнено(Отчет.Организация) Тогда
		Отчет.Организация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	Отчет.Фондовые = 1;
	
	Если Не ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		Отчет.НачалоПериода = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Отчет.КонецПериода = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ФондоваяКнигаОтдельноОтДенежной") Тогда
		Элементы.Фондовые.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ВывестиТолькоТитульныеЛисты.Доступность = Отчет.ВывестиТитульныеЛисты;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоВсемОрганизациямПриИзменении(Элемент)
	
	Если Отчет.ПоВсемОрганизациям Тогда
		
		Отчет.Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Отчет.Подразделение = ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка");
		
	КонецЕсли;	
		
	Элементы.Организация.Доступность = НЕ Отчет.ПоВсемОрганизациям;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Подразделение", "Доступность", НЕ Отчет.ПоВсемОрганизациям);

КонецПроцедуры

&НаКлиенте
Процедура ВывестиТитульныеЛистыПриИзменении(Элемент)
	
	Отчет.ВывестиТолькоТитульныеЛисты = Отчет.ВывестиТолькоТитульныеЛисты И Отчет.ВывестиТитульныеЛисты;
	
	Элементы.ВывестиТолькоТитульныеЛисты.Доступность = Отчет.ВывестиТитульныеЛисты;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	
	СформироватьОтчетСервер(Отказ);
	
	
	Если Отказ Тогда
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Нет данных для печати. Проверьте параметры отчета.'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала 	= Отчет.НачалоПериода;
	Диалог.Период.ДатаОкончания = Отчет.КонецПериода;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		
		Отчет.НачалоПериода = Период.ДатаНачала;
		Отчет.КонецПериода  = Период.ДатаОкончания;
		
	КонецЕсли;

КонецПроцедуры

// Процедура вызывает заполнение отчета. В случае формирования по одной
 // организации, удаляются все дополнительные закладки и таблицы с формы,
 // кроме стандартных.
 // В случае формирования отчета по всем организациям, закладка Кассовая книга
 // прячется и на форме создаются закладки и таблицы для каждой организации.
 // 
&НаСервере
Процедура СформироватьОтчетСервер(Отказ = Ложь)
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНачала", 		НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("ДатаКонца", 			КонецДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", Отчет.ПоВсемОрганизациям);	
	Запрос.УстановитьПараметр("Организация", 		Отчет.Организация);	
	Запрос.УстановитьПараметр("ЕстьПодразделение", 	ЗначениеЗаполнено(Отчет.Подразделение)); 	
	Запрос.УстановитьПараметр("Подразделение", 		Отчет.Подразделение);	
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛистКассовойКниги.Организация,
	|	ВЫБОР
	|		КОГДА ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига
	|			ТОГДА ЛистКассовойКниги.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЛистКассовойКниги.Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование
	|			ТОГДА ЛистКассовойКниги.Организация.НаименованиеСокращенное
	|		КОГДА ЛистКассовойКниги.Организация.НаименованиеПолное = """"
	|			ТОГДА ЛистКассовойКниги.Организация.Наименование
	|		ИНАЧЕ ЛистКассовойКниги.Организация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ЛистКассовойКниги.Организация.Наименование КАК ОргНаименование,
	|	ЛистКассовойКниги.Организация.Код КАК ОргКод,
	|	ЛистКассовойКниги.Организация.КодОКПО КАК КодОКПО,
	|	ВЫБОР
	|		КОГДА ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига
	|			ТОГДА ВЫБОР
	|					КОГДА ЛистКассовойКниги.Подразделение.НаименованиеПолное = """"
	|						ТОГДА ЛистКассовойКниги.Подразделение.Наименование
	|					ИНАЧЕ ЛистКассовойКниги.Подразделение.НаименованиеПолное
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НаименованиеПодразделения,
	|	ВЫБОР
	|		КОГДА ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига
	|			ТОГДА ЛистКассовойКниги.Подразделение.Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодрНаименование,
	|	ВЫБОР
	|		КОГДА ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига
	|			ТОГДА ЛистКассовойКниги.Подразделение.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодрКод,
	|	ОтветственныеЛицаГлавныйБухгалтер.ОтветственноеЛицо КАК ГлБухгалтер,
	|	ОтветственныеЛицаРуководитель.ОтветственноеЛицо КАК Руководитель,
	|	ЛистКассовойКниги.Ссылка КАК ЛистКассовойКнигиСсылка,
	|	ЛистКассовойКниги.КоличествоЛистов КАК КолВоЛистов,
	|	ЛистКассовойКниги.Дата КАК Дата,
	|	ЛистКассовойКниги.НомерЛиста КАК НомерЛиста
	|ПОМЕСТИТЬ ВсеЛистыКниги
	|ИЗ
	|	Документ.ЛистКассовойКниги КАК ЛистКассовойКниги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаКонца, ВидОтветственногоЛица = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК ОтветственныеЛицаРуководитель
	|		ПО ЛистКассовойКниги.Организация = ОтветственныеЛицаРуководитель.Организация
	|			И (ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига
	|					И ЛистКассовойКниги.Подразделение = ОтветственныеЛицаРуководитель.Подразделение
	|				ИЛИ (НЕ ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига
	|					ИЛИ ЛистКассовойКниги.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|						И (ОтветственныеЛицаРуководитель.Подразделение ЕСТЬ NULL 
	|							ИЛИ ОтветственныеЛицаРуководитель.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаКонца, ВидОтветственногоЛица = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)) КАК ОтветственныеЛицаГлавныйБухгалтер
	|		ПО ЛистКассовойКниги.Организация = ОтветственныеЛицаГлавныйБухгалтер.Организация
	|					И (ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига
	|						И ЛистКассовойКниги.Подразделение = ОтветственныеЛицаГлавныйБухгалтер.Подразделение
	|				ИЛИ (НЕ ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига
	|					ИЛИ ЛистКассовойКниги.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|						И (ОтветственныеЛицаГлавныйБухгалтер.Подразделение ЕСТЬ NULL 
	|							ИЛИ ОтветственныеЛицаГлавныйБухгалтер.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))))
	|ГДЕ
	|	ЛистКассовойКниги.Проведен
	|	И ЛистКассовойКниги.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И (&ЕстьПодразделение
	|				И ЛистКассовойКниги.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ЛистКассовойКниги.Подразделение ЕСТЬ NULL 
	|					ИЛИ ЛистКассовойКниги.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (НЕ &ПоВсемОрганизациям
	|				И ЛистКассовойКниги.Организация = &Организация
	|			ИЛИ &ПоВсемОрганизациям)";
	
	Если НЕ ПолучитьФункциональнуюОпцию("ФондоваяКнигаОтдельноОтДенежной") Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛистКассовойКнигиФондовый.Организация,
		|	ВЫБОР
		|		КОГДА ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига
		|			ТОГДА ЛистКассовойКнигиФондовый.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЛистКассовойКнигиФондовый.Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование
		|			ТОГДА ЛистКассовойКнигиФондовый.Организация.НаименованиеСокращенное
		|		КОГДА ЛистКассовойКнигиФондовый.Организация.НаименованиеПолное = """"
		|			ТОГДА ЛистКассовойКнигиФондовый.Организация.Наименование
		|		ИНАЧЕ ЛистКассовойКнигиФондовый.Организация.НаименованиеПолное
		|	КОНЕЦ,
		|	ЛистКассовойКнигиФондовый.Организация.Наименование,
		|	ЛистКассовойКнигиФондовый.Организация.Код,
		|	ЛистКассовойКнигиФондовый.Организация.КодОКПО,
		|	ВЫБОР
		|		КОГДА ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига
		|			ТОГДА ВЫБОР
		|					КОГДА ЛистКассовойКнигиФондовый.Подразделение.НаименованиеПолное = """"
		|						ТОГДА ЛистКассовойКнигиФондовый.Подразделение.Наименование
		|					ИНАЧЕ ЛистКассовойКнигиФондовый.Подразделение.НаименованиеПолное
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига
		|			ТОГДА ЛистКассовойКнигиФондовый.Подразделение.Наименование
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига
		|			ТОГДА ЛистКассовойКнигиФондовый.Подразделение.Код
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ОтветственныеЛицаГлавныйБухгалтер.ОтветственноеЛицо,
		|	ОтветственныеЛицаРуководитель.ОтветственноеЛицо,
		|	ЛистКассовойКнигиФондовый.Ссылка,
		|	ЛистКассовойКнигиФондовый.КоличествоЛистов,
		|	ЛистКассовойКнигиФондовый.Дата,
		|	ЛистКассовойКнигиФондовый.НомерЛиста
		|ИЗ
		|	Документ.ЛистКассовойКнигиФондовый КАК ЛистКассовойКнигиФондовый
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаКонца, ВидОтветственногоЛица = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК ОтветственныеЛицаРуководитель
		|		ПО ЛистКассовойКнигиФондовый.Организация = ОтветственныеЛицаРуководитель.Организация
		|			И (ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига
		|					И ЛистКассовойКнигиФондовый.Подразделение = ОтветственныеЛицаРуководитель.Подразделение
		|				ИЛИ (НЕ ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига
		|					ИЛИ ЛистКассовойКнигиФондовый.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|						И (ОтветственныеЛицаРуководитель.Подразделение ЕСТЬ NULL 
		|							ИЛИ ОтветственныеЛицаРуководитель.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаКонца, ВидОтветственногоЛица = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)) КАК ОтветственныеЛицаГлавныйБухгалтер
		|		ПО ЛистКассовойКнигиФондовый.Организация = ОтветственныеЛицаГлавныйБухгалтер.Организация
		|					И (ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига
		|						И ЛистКассовойКнигиФондовый.Подразделение = ОтветственныеЛицаГлавныйБухгалтер.Подразделение
		|				ИЛИ (НЕ ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига
		|					ИЛИ ЛистКассовойКнигиФондовый.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|						И (ОтветственныеЛицаГлавныйБухгалтер.Подразделение ЕСТЬ NULL 
		|							ИЛИ ОтветственныеЛицаГлавныйБухгалтер.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))))
		|ГДЕ
		|	ЛистКассовойКнигиФондовый.Проведен
		|	И ЛистКассовойКнигиФондовый.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
		|	И (&ЕстьПодразделение
		|				И ЛистКассовойКнигиФондовый.Подразделение = &Подразделение
		|			ИЛИ НЕ &ЕстьПодразделение
		|				И (ЛистКассовойКнигиФондовый.Подразделение ЕСТЬ NULL 
		|					ИЛИ ЛистКассовойКнигиФондовый.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|					ИЛИ НЕ ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига)
		|			ИЛИ &ПоВсемОрганизациям)
		|	И (НЕ &ПоВсемОрганизациям
		|				И ЛистКассовойКнигиФондовый.Организация = &Организация
		|			ИЛИ &ПоВсемОрганизациям)";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЛистыКниги.Организация КАК Организация,
	|	ВсеЛистыКниги.Подразделение КАК Подразделение,
	|	ВсеЛистыКниги.ОргКод,
	|	ВсеЛистыКниги.ОргНаименование,
	|	ВсеЛистыКниги.НаименованиеОрганизации,
	|	ВсеЛистыКниги.КодОКПО,
	|	ВсеЛистыКниги.ПодрКод,
	|	ВсеЛистыКниги.ПодрНаименование,
	|	ВсеЛистыКниги.НаименованиеПодразделения,
	|	ФИОГлБухгалтер.Фамилия КАК ГлБухгалтерФамилия,
	|	ФИОГлБухгалтер.Имя КАК ГлБухгалтерИмя,
	|	ФИОГлБухгалтер.Отчество КАК ГлБухгалтерОтчество,
	|	ФИОРуководитель.Фамилия КАК РуководительФамилия,
	|	ФИОРуководитель.Имя КАК РуководительИмя,
	|	ФИОРуководитель.Отчество КАК РуководительОтчество,
	|	СУММА(ВсеЛистыКниги.КолВоЛистов) КАК КолВоЛистов
	|ИЗ
	|	ВсеЛистыКниги КАК ВсеЛистыКниги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаКонца, ) КАК ФИОГлБухгалтер
	|		ПО ВсеЛистыКниги.ГлБухгалтер.Контрагент.ЮридическоеФизическоеЛицо = ФИОГлБухгалтер.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОРуководитель
	|		ПО ВсеЛистыКниги.Руководитель.Контрагент.ЮридическоеФизическоеЛицо = ФИОРуководитель.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеЛистыКниги.ОргНаименование,
	|	ВсеЛистыКниги.ОргКод,
	|	ВсеЛистыКниги.НаименованиеОрганизации,
	|	ВсеЛистыКниги.КодОКПО,
	|	ФИОРуководитель.Имя,
	|	ФИОРуководитель.Отчество,
	|	ВсеЛистыКниги.Организация,
	|	ВсеЛистыКниги.Подразделение,
	|	ВсеЛистыКниги.ПодрКод,
	|	ВсеЛистыКниги.ПодрНаименование,
	|	ВсеЛистыКниги.НаименованиеПодразделения,
	|	ФИОГлБухгалтер.Фамилия,
	|	ФИОГлБухгалтер.Имя,
	|	ФИОГлБухгалтер.Отчество,
	|	ФИОРуководитель.Фамилия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЛистыКниги.Организация КАК Организация,
	|	ВсеЛистыКниги.Подразделение КАК Подразделение,
	|	ВсеЛистыКниги.ЛистКассовойКнигиСсылка
	|ИЗ
	|	ВсеЛистыКниги КАК ВсеЛистыКниги
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Подразделение,
	|	ВсеЛистыКниги.Дата,
	|	ВсеЛистыКниги.НомерЛиста";
	
	
	Если ПолучитьФункциональнуюОпцию("ФондоваяКнигаОтдельноОтДенежной") И Отчет.Фондовые = 2 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ЛистКассовойКниги", "Документ.ЛистКассовойКнигиФондовый");
		
	КонецЕсли;
	
	
			
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаОрганизации = МассивРезультатов[1].Выбрать();
	
	ТаблицаДокументов =  МассивРезультатов[2].Выгрузить();
	
	Отказ = ВыборкаОрганизации.Количество() = 0;
	
	// удалим все добавленные элементы
	МассивУдаляемыхРеквизитов = Новый Массив;
	МассивУдаляемыхЭлементов = Новый Массив;
	Для ТекИнд = 2 по Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.Количество() Цикл
		МассивУдаляемыхРеквизитов.Добавить(Элементы.ГруппаСтраниц.ПодчиненныеЭлементы[ТекИнд-1].ПодчиненныеЭлементы[0].ПутьКДанным);	
		МассивУдаляемыхЭлементов.Добавить(Элементы.ГруппаСтраниц.ПодчиненныеЭлементы[ТекИнд-1]);
	КонецЦикла;
	Для каждого Элемент из МассивУдаляемыхЭлементов Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
	
	Если Отказ Тогда
		
		КассоваяКнига.Очистить();
		Элементы.ГруппаСтраниц.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		Элементы.ГруппаКассоваяКнига.Видимость = Истина;
		
		Возврат;
		
	КонецЕсли;	

	ТипыРеквизита = Новый Массив;
	ТипыРеквизита.Добавить(Тип("ТабличныйДокумент"));
	ОписаниеТиповРеквизитов = Новый ОписаниеТипов(ТипыРеквизита);
	
	КассовыеКниги = Новый Массив;
	 
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ОтчетКассира");
	 
	ОбластьТитульныйЛист = Макет.ПолучитьОбласть("ТитульныйЛист"); 
	
	Пока ВыборкаОрганизации.Следующий() Цикл
		
		КассоваяКнигаОрганизации = Новый ТабличныйДокумент;
		
		Если Отчет.ВывестиТитульныеЛисты Тогда
			
			СтруктураОбл = Новый Структура;
			СтруктураОбл.Вставить("РуководительФИО", 		КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество", ВыборкаОрганизации.РуководительФамилия, ВыборкаОрганизации.РуководительИмя, ВыборкаОрганизации.РуководительОтчество), Истина));					
			СтруктураОбл.Вставить("ГлБухгалтерФИО", 		КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество", ВыборкаОрганизации.ГлБухгалтерФамилия, ВыборкаОрганизации.ГлБухгалтерИмя, ВыборкаОрганизации.ГлБухгалтерОтчество), Истина));
			СтруктураОбл.Вставить("КолВоЛистовПрописью",	ЧислоПрописью(ВыборкаОрганизации.КолВоЛистов, , " лист, листа, листов, м,,,,,0"));
			СтруктураОбл.Вставить("ЗаПериод", 				"За " + ПредставлениеПериода(НачалоДня(Отчет.НачалоПериода), КонецДня(Отчет.КонецПериода), "ФП = Истина")); 
			
			ОбластьТитульныйЛист.Параметры.Заполнить(ВыборкаОрганизации);
            ОбластьТитульныйЛист.Параметры.Заполнить(СтруктураОбл);
			
            КассоваяКнигаОрганизации.Вывести(ОбластьТитульныйЛист);
			
			КассоваяКнигаОрганизации.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;	
		
		Если НЕ Отчет.ВывестиТолькоТитульныеЛисты Тогда
			
			ВрТаблица = ТаблицаДокументов.Скопировать(Новый Структура("Организация, Подразделение", ВыборкаОрганизации.Организация, ВыборкаОрганизации.Подразделение));
			
			МассивОбъектов = ВрТаблица.ВыгрузитьКолонку("ЛистКассовойКнигиСсылка");
			
			ОбъектыПечати = Новый СписокЗначений;
			
			КассоваяКнигаОрганизации.Вывести(КассаОрганизации.ПечатьОтчетаКассира(МассивОбъектов, ОбъектыПечати, , , , "ПФ_MXL_ОтчетКассира"));
			
			//Элемент и реквизит формы для размещения кассовой книги
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			ИДКассовойКниги = СокрЛП(ВыборкаОрганизации.ОргКод) + СокрЛП(ВыборкаОрганизации.ПодрКод);
			
			НовСтр = Элементы.Добавить("Страница" + ИДКассовойКниги, Тип("ГруппаФормы"), Элементы.ГруппаСтраниц);
			НовСтр.Заголовок = ВыборкаОрганизации.ПодрНаименование + " " + ВыборкаОрганизации.ОргНаименование;
			
			НовыйРеквизит = Новый РеквизитФормы("Таблица" + ИДКассовойКниги, ОписаниеТиповРеквизитов);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
			КассовыеКниги.Добавить(НовСтр);
			
			НовТаб=Элементы.Добавить("Таблица" + ИДКассовойКниги, Тип("ПолеФормы"), НовСтр);
			НовТаб.ПутьКДанным="Таблица" + ИДКассовойКниги;
			НовТаб.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			
			ЭтаФорма["Таблица" + ИДКассовойКниги].Очистить();
			ЭтаФорма["Таблица" + ИДКассовойКниги].Вывести(КассоваяКнигаОрганизации);
			
		Иначе
			
			КассоваяКнига.Вывести(КассоваяКнигаОрганизации);

		КонецЕсли;
		
	КонецЦикла;	
	
	Если Отчет.ВывестиТолькоТитульныеЛисты Тогда
		
		Элементы.ГруппаКассоваяКнига.Видимость = Истина;
		
		КассовыеКниги.Добавить(Элементы.ГруппаКассоваяКнига);
		
	Иначе
		
		Элементы.ГруппаКассоваяКнига.Видимость = Ложь;
		
	КонецЕсли;	
	
	
	Если КассовыеКниги.Количество() > 1 Тогда
		
		Элементы.ГруппаСтраниц.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		
	Иначе
	
		Элементы.ГруппаСтраниц.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		
	КонецЕсли;
	
	Элементы.ГруппаСтраниц.ТекущаяСтраница = КассовыеКниги[0];
		
 КонецПроцедуры

 #КонецОбласти
